Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4S4C.xml
        <register caption="Interrupt Status Register" name="DACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Flag" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Flag" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of DMA Interrupt Flag" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty" mask="0x00000008" name="TXBUFE"/>
        </register>
        <register caption="Analog Current Register" name="DACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Analog Output Current Control" mask="0x00000003" name="IBCTLCH0"/>
          <bitfield caption="Analog Output Current Control" mask="0x0000000C" name="IBCTLCH1"/>
          <bitfield caption="Bias Current Control for DAC Core" mask="0x00000300" name="IBCTLDACCORE"/>
        </register>
        <register caption="Write Protection Mode Register" name="DACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection KEY" mask="0xFFFFFF00" name="WPKEY" values="DACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="DACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
        <register caption="Transmit Pointer Register" name="DACC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="DACC_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="DACC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="DACC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="DACC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="DACC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="DACC_MR__TRGEN">
        <value caption="External trigger mode disabled. DACC in free-running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__TRGSEL">
        <value caption="External trigger" name="TRGSEL0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="TRGSEL1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="TRGSEL2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="TRGSEL3" value="0x3"/>
        <value caption="PWM Event Line 0" name="TRGSEL4" value="0x4"/>
        <value caption="PWM Event Line 1" name="TRGSEL5" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_MR__WORD">
        <value caption="Half-word transfer" name="HALF" value="0"/>
        <value caption="Word transfer" name="WORD" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__SLEEP">
        <value caption="Normal mode: the DAC core and reference voltage circuitry are kept ON between conversions." name="DISABLED" value="0"/>
        <value caption="Sleep mode: the DAC core and/or reference voltage circuitry are OFF between conversions." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__FASTWKUP">
        <value caption="Normal sleep mode: the sleep mode is defined by the SLEEP bit. Voltage reference is OFF between conversions." name="STAMODE" value="0"/>
        <value caption="Fast wake-up after sleep mode: voltage reference is kept ON between conversions; DAC core is OFF" name="FASTWAKEUP" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__USER_SEL">
        <value caption="Channel 0" name="CHANNEL0" value="0"/>
        <value caption="Channel 1" name="CHANNEL1" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__TAG">
        <value caption="Tag selection mode disabled. Using USER_SEL to select the channel for the conversion." name="DIS" value="0"/>
        <value caption="Tag selection mode enabled" name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__MAXS">
        <value caption="Normal mode" name="NORMAL" value="0"/>
        <value caption="Maximum speed mode enabled" name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__STARTUP">
        <value caption="0 periods of DACClock" name="_0" value="0x0"/>
        <value caption="8 periods of DACClock" name="_8" value="0x1"/>
        <value caption="16 periods of DACClock" name="_16" value="0x2"/>
        <value caption="24 periods of DACClock" name="_24" value="0x3"/>
        <value caption="64 periods of DACClock" name="_64" value="0x4"/>
        <value caption="80 periods of DACClock" name="_80" value="0x5"/>
        <value caption="96 periods of DACClock" name="_96" value="0x6"/>
        <value caption="112 periods of DACClock" name="_112" value="0x7"/>
        <value caption="512 periods of DACClock" name="_512" value="0x8"/>
        <value caption="576 periods of DACClock" name="_576" value="0x9"/>
        <value caption="640 periods of DACClock" name="_640" value="0xA"/>
        <value caption="704 periods of DACClock" name="_704" value="0xB"/>
        <value caption="768 periods of DACClock" name="_768" value="0xC"/>
        <value caption="832 periods of DACClock" name="_832" value="0xD"/>
        <value caption="896 periods of DACClock" name="_896" value="0xE"/>
        <value caption="960 periods of DACClock" name="_960" value="0xF"/>
        <value caption="1024 periods of DACClock" name="_1024" value="0x10"/>
        <value caption="1088 periods of DACClock" name="_1088" value="0x11"/>
        <value caption="1152 periods of DACClock" name="_1152" value="0x12"/>
        <value caption="1216 periods of DACClock" name="_1216" value="0x13"/>
        <value caption="1280 periods of DACClock" name="_1280" value="0x14"/>
        <value caption="1344 periods of DACClock" name="_1344" value="0x15"/>
        <value caption="1408 periods of DACClock" name="_1408" value="0x16"/>
        <value caption="1472 periods of DACClock" name="_1472" value="0x17"/>
        <value caption="1536 periods of DACClock" name="_1536" value="0x18"/>
        <value caption="1600 periods of DACClock" name="_1600" value="0x19"/>
        <value caption="1664 periods of DACClock" name="_1664" value="0x1A"/>
        <value caption="1728 periods of DACClock" name="_1728" value="0x1B"/>
        <value caption="1792 periods of DACClock" name="_1792" value="0x1C"/>
        <value caption="1856 periods of DACClock" name="_1856" value="0x1D"/>
        <value caption="1920 periods of DACClock" name="_1920" value="0x1E"/>
        <value caption="1984 periods of DACClock" name="_1984" value="0x1F"/>
        <value caption="2048 periods of DACClock" name="_2048" value="0x20"/>
        <value caption="2112 periods of DACClock" name="_2112" value="0x21"/>
        <value caption="2176 periods of DACClock" name="_2176" value="0x22"/>
        <value caption="2240 periods of DACClock" name="_2240" value="0x23"/>
        <value caption="2304 periods of DACClock" name="_2304" value="0x24"/>
        <value caption="2368 periods of DACClock" name="_2368" value="0x25"/>
        <value caption="2432 periods of DACClock" name="_2432" value="0x26"/>
        <value caption="2496 periods of DACClock" name="_2496" value="0x27"/>
        <value caption="2560 periods of DACClock" name="_2560" value="0x28"/>
        <value caption="2624 periods of DACClock" name="_2624" value="0x29"/>
        <value caption="2688 periods of DACClock" name="_2688" value="0x2A"/>
        <value caption="2752 periods of DACClock" name="_2752" value="0x2B"/>
        <value caption="2816 periods of DACClock" name="_2816" value="0x2C"/>
        <value caption="2880 periods of DACClock" name="_2880" value="0x2D"/>
        <value caption="2944 periods of DACClock" name="_2944" value="0x2E"/>
        <value caption="3008 periods of DACClock" name="_3008" value="0x2F"/>
        <value caption="3072 periods of DACClock" name="_3072" value="0x30"/>
        <value caption="3136 periods of DACClock" name="_3136" value="0x31"/>
        <value caption="3200 periods of DACClock" name="_3200" value="0x32"/>
        <value caption="3264 periods of DACClock" name="_3264" value="0x33"/>
        <value caption="3328 periods of DACClock" name="_3328" value="0x34"/>
        <value caption="3392 periods of DACClock" name="_3392" value="0x35"/>
        <value caption="3456 periods of DACClock" name="_3456" value="0x36"/>
        <value caption="3520 periods of DACClock" name="_3520" value="0x37"/>
        <value caption="3584 periods of DACClock" name="_3584" value="0x38"/>
        <value caption="3648 periods of DACClock" name="_3648" value="0x39"/>
        <value caption="3712 periods of DACClock" name="_3712" value="0x3A"/>
        <value caption="3776 periods of DACClock" name="_3776" value="0x3B"/>
        <value caption="3840 periods of DACClock" name="_3840" value="0x3C"/>
        <value caption="3904 periods of DACClock" name="_3904" value="0x3D"/>
        <value caption="3968 periods of DACClock" name="_3968" value="0x3E"/>
        <value caption="4032 periods of DACClock" name="_4032" value="0x3F"/>
      </value-group>
      <value-group caption="" name="DACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x444143"/>
      </value-group>
    </module>
