Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4S4C.xml
        <register caption="Interrupt Mask Register" name="UART_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Mask End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Mask TXBUFE Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Mask RXBUFF Interrupt" mask="0x00001000" name="RXBUFF"/>
        </register>
        <register caption="Status Register" name="UART_SR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmitter Transfer" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Transmission Buffer Empty" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full" mask="0x00001000" name="RXBUFF"/>
        </register>
        <register caption="Receive Holding Register" name="UART_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="UART_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="UART_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD"/>
        </register>
        <register caption="Receive Pointer Register" name="UART_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="UART_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="UART_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="UART_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="UART_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="UART_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="UART_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="UART_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="UART_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="UART_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="UART_MR__PAR">
        <value caption="Even Parity" name="EVEN" value="0x0"/>
        <value caption="Odd Parity" name="ODD" value="0x1"/>
        <value caption="Space: parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
      </value-group>
      <value-group caption="" name="UART_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
    </module>
    <module caption="USB Device Port" name="UDP" version="6083X">
      <register-group name="UDP">
        <register caption="Frame Number Register" name="UDP_FRM_NUM" offset="0x000" rw="R" size="4">
          <bitfield caption="Frame Number as Defined in the Packet Field Formats" mask="0x000007FF" name="FRM_NUM"/>
          <bitfield caption="Frame Error" mask="0x00010000" name="FRM_ERR"/>
          <bitfield caption="Frame OK" mask="0x00020000" name="FRM_OK"/>
        </register>
        <register caption="Global State Register" name="UDP_GLB_STAT" offset="0x004" rw="RW" size="4">
          <bitfield caption="Function Address Enable" mask="0x00000001" name="FADDEN"/>
          <bitfield caption="Configured" mask="0x00000002" name="CONFG"/>
          <bitfield caption="Enable Send Resume" mask="0x00000004" name="ESR"/>
          <bitfield mask="0x00000008" name="RSMINPR"/>
          <bitfield caption="Remote Wake Up Enable" mask="0x00000010" name="RMWUPE"/>
        </register>
        <register caption="Function Address Register" name="UDP_FADDR" offset="0x008" rw="RW" size="4">
          <bitfield caption="Function Address Value" mask="0x0000007F" name="FADD"/>
          <bitfield caption="Function Enable" mask="0x00000100" name="FEN"/>
        </register>
        <register caption="Interrupt Enable Register" name="UDP_IER" offset="0x010" rw="W" size="4">
          <bitfield caption="Enable Endpoint 0 Interrupt" mask="0x00000001" name="EP0INT"/>
          <bitfield caption="Enable Endpoint 1 Interrupt" mask="0x00000002" name="EP1INT"/>
          <bitfield caption="Enable Endpoint 2Interrupt" mask="0x00000004" name="EP2INT"/>
          <bitfield caption="Enable Endpoint 3 Interrupt" mask="0x00000008" name="EP3INT"/>
          <bitfield caption="Enable Endpoint 4 Interrupt" mask="0x00000010" name="EP4INT"/>
          <bitfield caption="Enable Endpoint 5 Interrupt" mask="0x00000020" name="EP5INT"/>
          <bitfield caption="Enable Endpoint 6 Interrupt" mask="0x00000040" name="EP6INT"/>
          <bitfield caption="Enable Endpoint 7 Interrupt" mask="0x00000080" name="EP7INT"/>
          <bitfield caption="Enable UDP Suspend Interrupt" mask="0x00000100" name="RXSUSP"/>
          <bitfield caption="Enable UDP Resume Interrupt" mask="0x00000200" name="RXRSM"/>
          <bitfield mask="0x00000400" name="EXTRSM"/>
          <bitfield caption="Enable Start Of Frame Interrupt" mask="0x00000800" name="SOFINT"/>
          <bitfield caption="Enable UDP bus Wakeup Interrupt" mask="0x00002000" name="WAKEUP"/>
        </register>
